{
  "data": [
    {
      "folderName": "Work",
      "content": "# Work",
      "createdAt": 1716738752,
      "deletedAt": null
    },
    {
      "folderName": "Other",
      "content": "# Other",
      "createdAt": 1716738743,
      "deletedAt": null
    },
    {
      "folderName": "OpenNotas",
      "content": "# Introduction \n\nOpenNotas is an open-source, multi-platform note-taking application based on PWA, focusing on security and synchronization capabilities across devices.\n\nOpenNotas carries the philosophy of \"simplicity in use\", for anyone, any task that needs to be noted down in text form quickly and reliably.\n\nOpenNotas supports Markdown, uses open-source text editing tools, making it easy to extend additional features and utilities.\n\nOpenNotas supports synchronization via Adapter along with security capabilities based on the AES encryption algorithm. It also supports note locking with a similar encryption algorithm.\n\nStart using it now!\n\n",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "OpenNotas",
      "content": "# Giới thiệu \n\nOpenNotas là một ứng dụng ghi chú mã nguồn mở, đa nền tảng dựa trên PWA, tập trung vào bảo mật và khả năng đồng bộ giữa các thiết bị.\n\nOpenNotas mang triết lý \"đơn giản để sử dụng\", cho bất kỳ ai, bất kỳ công việc nào cần phải ghi chép lại dưới dạng văn bản một cách nhanh chóng và đáng tin cậy.\n\nOpenNotas hỗ trợ Markdown, sử dụng các công cụ soạn thảo văn bản mã nguồn mở, dễ dàng mở rộng thêm tính năng và tiện ích.\n\nOpenNotas hỗ trợ đồng bộ qua Adapter cùng với khả năng bảo mật dựa trên thuật toán mã hóa AES. Hỗ trợ khóa ghi chú cùng với thuật toán mã hóa tương tự.\n\nHãy bắt đầu sử dụng ngay!\n\n",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "OpenNotas",
      "content": "# Đồng bộ và bảo mật \n\nMặc định, OpenNotas sử dụng bộ nhớ của thiết bị để lưu trữ dữ liệu ghi chú của bạn. Để tận dụng tối đa sức mạnh của nó, bạn hãy sử dụng tính năng Đồng bộ.\n\nBạn cần một máy chủ đồng bộ để sử dụng tính năng này. OpenNotas hiện tại chưa cung cấp máy chủ đồng bộ, vì thế bạn có thể tự xây dựng cho mình một máy chủ chỉ trong một vài bước đơn giản. Tham khảo: https://docs.opennotas.io\n\nOpenNotas có cơ chế riêng để bảo vệ ghi chú. Dữ liệu trước khi đồng bộ lên máy chủ phải được mã hóa bằng thuật toán mã hóa đối xứng AES tiên tiến nhất hiện nay. Tương tự, dữ liệu từ máy chủ đồng bộ về phải qua một bước giải mã thì mới được ghi nhận.\n\nĐể làm được điều đó, khi lần đầu thiết lập máy chủ đồng bộ, bạn sẽ được cung cấp một khóa mã hóa. Khóa này rất quan trọng, nó đóng vai trò trong việc mã hóa và giải mã dữ liệu. Vì thế hãy lưu trữ nó thật cẩn thận và đừng bao giờ cho ai biết nội dung của nó. Bạn sẽ cần phải nhập lại khóa mỗi khi thiết lập đồng bộ trên một thiết bị mới.\n\n\n\n",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "OpenNotas",
      "content": "# Synchronization and Security \n\nBy default, OpenNotas uses your device's memory to store your note data. To fully harness its power, you should utilize the Synchronization feature.\n\nYou will need a synchronization server to use this feature. Currently, OpenNotas does not provide a synchronization server, so you can build your own server in just a few simple steps. Refer to: https://docs.opennotas.io\n\nOpenNotas has its own mechanism to protect your notes. Data must be encrypted using the most advanced symmetric AES encryption algorithm before it is synchronized to the server. Similarly, data from the synchronization server must go through a decryption step before it is recorded.\n\nTo do this, when setting up the synchronization server for the first time, you will be provided with an encryption key. This key is very important, as it plays a role in encrypting and decrypting data. Therefore, store it very carefully and never let anyone know its contents. You will need to re-enter the key each time you set up synchronization on a new device.",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "Personal",
      "content": "# Danh sách việc cần làm\n\n- [x] Sáng thức dậy, đánh răng, rửa mặt\n- [x] Ăn sáng, uống cà phê\n- [x] Đi đến nơi làm việc\n- [ ] Làm việc\n- [ ] Tan làm, đi siêu thị\n- [ ] Chạy bộ 30 phút\n- [ ] Nấu ăn và ăn tối\n- [ ] Tắm\n- [ ] Nghe nhạc thư giãn\n- [ ] Đọc sách\n- [ ] Đi ngủ ",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "Personal",
      "content": "# To-Do List\n\n- [x] Wake up, brush teeth, wash face\n- [x] Eat breakfast, drink coffee\n- [x] Go to work\n- [ ] Work\n- [ ] Finish work, go to the supermarket\n- [ ] Run for 30 minutes\n- [ ] Cook and eat dinner\n- [ ] Take a bath\n- [ ] Listen to relaxing music\n- [ ] Read a book\n- [ ] Go to sleep ",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "Personal",
      "content": "# Tất tần tật về OpenNotas - Nó là gì? \n\n## Vấn đề\n\nCách đây gần 2 tháng, khi đang trung thành với Apple Notes để làm nơi viết lách thì bỗng nhiên chiếc điện thoại tai thỏ của tôi dở chứng, buộc phải chuyển sang một thiết bị Android vì kinh phí eo hẹp. Lúc này thì tôi nhận ra Apple Notes không còn sử dụng được trên thiết bị mới được nữa. Hãy tưởng tượng trước đó khi mọi ghi chú giữa máy tính và điện thoại đang được đồng bộ một cách mượt mà thì giờ đây quá trình đó đã bị ngắt quãng, gây ra một trải nghiệm không thể tồi tệ hơn.  \n\nTrong khi loay hoay tìm cho mình một ứng dụng ghi chú mới. Rất nhiều cái tên đã được khám phá và tải về dùng thử. Có cái tốt, có cái dở. Tốt vì đáp ứng được nhu cầu là ghi chú đa nền tảng, đồng bộ và bảo mật. Còn dở là... đa số đều phải trả phí, nếu không sẽ bị giới hạn về số lượng ghi chú hay khả năng đồng bộ. Chính vì thế đã đẩy tôi đến một quyết định quan trọng: Tự làm một ứng dụng ghi chú mà bây giờ được biết đến với cái tên là OpenNotas (ON).  \n\nCó rất nhiều bài học và cả kiến thức mới mà tôi rút ra được trong quá trình làm ứng dụng. Hầu hết những gì khám phá ra đều được tóm tắt lại trong nhật ký hàng tuần kể về quá trình làm OpenNotas. Bạn đọc có thể lướt trang chủ một lúc là sẽ thấy, còn không thì đây là danh sách các bài viết đang nhắc đến:  \n\n- [Làm ứng dụng ghi chú - Notas](https://2coffee.dev/bai-viet/lam-ung-dung-ghi-chu-notas)\n- [Nhật ký làm Notas - Kỳ đầu](https://2coffee.dev/bai-viet/nhat-ky-lam-notas-ky-dau)\n- [Nhật ký làm Notas - Kỳ II](https://2coffee.dev/bai-viet/nhat-ky-lam-notas-ky-ii)\n- [Nhật ký làm Notas - Kỳ III](https://2coffee.dev/bai-viet/nhat-ky-lam-notas-ky-iii)\n- [Nhật ký làm Notas - Vấn đề với bộ nhớ](https://2coffee.dev/bai-viet/nhat-ky-lam-notas-van-de-voi-bo-nho)\n- [Nhật ký làm Notas - Sẵn sàng Launching!](https://2coffee.dev/bai-viet/nhat-ky-lam-notas-san-sang-launching)\n\nCũng trong thời gian đó, tôi gặp lại một người anh đã từng làm việc cùng trước đây. Sau khi nghe câu chuyện, anh chợt nói \"Cái em đang làm người ta gọi là Indie Hackers\" - chỉ một bộ phận lập trình viên yêu thích làm sản phẩm. Ồ! Hóa ra lâu nay mình làm mà lại không biết về sự tồn tại của nó. Sau khi về nhà, tôi bắt đầu quan tâm đến cụm từ này, tham gia vào các cộng đồng Indie Hackers để tìm hiểu thêm, trao đổi, học hỏi kinh nghiệm từ những người có cùng sở thích.  \n\nChỉ còn chưa đến 2 tuần nữa, ON sẽ chính thức ra mắt. Vì thế đây là bài viết tóm tắt lại nhanh quá trình hình thành ON, nó sinh ra để giải quyết vấn đề gì và cả bài học rút ra cùng với khó khăn, thách thức.  \n\n## OpenNotas là gì?\n\nOpenNotas là một ứng dụng ghi chú cá nhân đơn giản, nhanh, tập trung vào bảo mật và hoàn toàn miễn phí.  \n\nOpenNotas được phát hành dưới dạng ứng dụng PWA - một kiểu ứng dụng dựa trên nền tảng Web. PWA mang lại thêm nhiều sức mạnh cho ứng dụng khi so với ứng dụng web thông thường, tiết kiệm được nhiều thời gian cho lập trình viên muốn phát triển một ứng dụng đa nền tảng. Đơn giản vì nếu muốn sử dụng, bạn chỉ cần một thiết bị hỗ trợ trình duyệt kết nối Internet.  \n\nOpenNotas ban đầu được tạo ra để giải quyết vấn đề của tôi là cần một ứng dụng ghi chú đa nền tảng, đơn giản và tập trung vào viết. Nhưng nếu nghĩ xa hơn, hoàn toàn có thể biến nó thành một sản phẩm Open Source, cho bất kỳ ai đang đi tìm một giải pháp mới bên cạnh rất nhiều ứng dụng đã có trước đó trên thị trường.  \n\nTrong quá trình đi tìm một ứng dụng ghi chú trước khi làm ON, tôi đã trải nghiệm qua rất nhiều cái tên và rút ra được nhiều điểm đáng chú ý. Nếu so với cái đã biết, điểm mạnh của ON có thể nằm ở sự đơn giản, linh hoạt, và kích thước siêu nhẹ nhờ vào PWA. Chỉ cần có một thiết bị hỗ trợ trình duyệt, gần như là đã có thể sử dụng. Tuy vậy, ON đang áp dụng nhiều công nghệ hiện đại để tối ưu hóa trải nghiệm nên bạn vẫn cần phải có một trình duyệt hiện đại, đủ tốt, để hỗ trợ các chức năng của nó.  \n\nOpenNotas cũng có thể cài đặt trực tiếp vào trong máy, bạn sẽ dùng bình thường mà không cần có kết nối Internet. Dữ liệu được lưu trữ bền vững trong máy. OpenNotas hỗ trợ cơ chế đồng bộ dữ liệu giữa các thiết bị thông qua cái gọi là Adapter. Bạn chỉ cần làm theo hướng dẫn để tự thiết lập cho mình một máy chủ đồng bộ.  \n\nGhi chú cá nhân cũng đòi hỏi phải có cơ chế bảo mật nghiêm ngặt. Chẳng đâu xa như tôi đây, có nhiều thông tin nhạy cảm vẫn cần phải ghi ra nếu không muốn quên mất. Mà đã ghi ra thì phải có cơ chế bảo vệ nó, không cho phép ai đọc. ON cung cấp cơ chế mã hóa dữ liệu hai chiều dựa trên thuật toán AES trước khi đồng bộ dữ liệu lên máy chủ. Điều đó có nghĩa dữ liệu sẽ được mã hóa trước khi rời thiết bị, bạn cần phải có khóa mã hóa thì mới giải mã được dữ liệu. Ngoài ra, ON còn có thêm tính năng đặt mật khẩu cho ghi chú, dữ liệu cũng được mã hóa AES, yêu cầu phải có mật khẩu thì mới có thể truy cập.  \n\nTạm quên những điểm mạnh kể trên, ON hiện đang \"lép vế\" so với nhiều đối thủ có tên tuổi trước đó. Tính năng của ON có thể không đa dạng và phong phú nhưng đó chỉ là vấn đề thời gian. Triết lý của ON là tập trung vào sự linh hoạt, nhanh chóng và khả năng bảo mật tốt nhất, mang lại sự an tâm cho người sử dụng.  \n\n## Bài học từ quá trình phát triển OpenNotas\n\nNhờ quá trình làm ON mà tôi biết đến khái niệm Indie Hackers. Kết nối được với nhiều người, tham gia các cộng đồng có cùng sở thích để bắt đầu tìm hiểu thêm vào lĩnh vực này.  \n\nON giúp tôi đào sâu hơn vào khái niệm PWA, hiểu hơn về cách ứng dụng hoạt động và thử thách bản thân trong việc làm một sản phẩm ứng dụng. Ngoài ra, vấn đề lưu trữ trên trình duyệt cũng rất được quan tâm. Mặc dù đang ở thời điểm đỉnh cao của ứng dụng web hiện đại nhưng vấn đề lưu trữ dữ liệu trong trình duyệt vẫn là cái gì đó rất \"khoai\".  \n\nON cũng giúp tôi rèn luyện kỹ năng viết. Viết ngôn ngữ trong ứng dụng, viết nhật ký, viết blog, viết tài liệu, viết các bài giới thiệu... Chưa bao giờ mà mình lại viết nhiều đến thế. Nói thật chứ đầu óc tôi giờ đây chẳng có gì ngoài những dòng chữ cứ chạy qua chạy lại trong một không gian chật hẹp.  \n\nCuối cùng, sau lần khởi chạy sắp tới chắc chắn sẽ có nhiều bài học được rút ra nữa. Nhưng dù là thành công hay thất bại thì vẫn mang lại nhiều bài học kinh nghiệm hơn cho mình. Chắc chắn rồi, ON không phải là sản phẩm cuối cùng, nó chỉ là sự khởi đầu cho mọi thứ sau này.  \n\n## Những gì còn thiếu sót?\n\nTôi biết rằng để vận hành một sản phẩm là không hề đơn giản. Đây là ứng dụng Open Source đầu tiên nên có nhiều thứ chưa biết hoặc cần thời gian để biết. Nếu cứ giữ khư khư mà không nói ra thì chẳng ai biết được mình đang gặp vấn đề gì. Ngược lại, khi đã nói ra ít nhiều sẽ nhận được sự hỗ trợ từ nhiều người đã có kinh nghiệm trước đó.  \n\nON được tạo ra trong sự gấp rút, được xây dựng trên Nuxt.js và thư viện DaisyUI. Nếu muốn đóng góp mã, cần phải tạo ra một bộ quy tắc trước khi cho cộng đồng thêm/sửa/xóa, thêm cả cấu hình để kiểm tra liệu mọi thứ đã theo chuẩn trước khi \"Merge\". Thú thật, tôi chưa có kinh nghiệm triển khai phần việc này, vì thế nếu bạn đã từng giải quyết vấn đề này rồi thì tôi nên làm gì tiếp theo đây?  \n\nTuy không làm nhiều về Open Source nhưng tôi vẫn biết đến cơ chế đánh số phiên bản tự động mỗi khi phát hành một phiên bản mới. Hay nói tóm gọn lại là cơ chế quản lý phiên bản và dựng các bản cập nhật tự động. Tôi nên tìm hiểu công cụ nào cho đơn giản?  \n\nCuối cùng là xây dựng một cộng đồng, làm nơi giao lưu hỏi đáp cho tất cả mọi người sử dụng ON. Theo bạn nền tảng nào là thuận lợi nhất cho người dùng?  \n\nCuối cùng, ON đã có mặt trên Product Hunt, đây là một sân chơi cho những ai làm sản phẩm, là một cơ hội tuyệt vời để quảng bá sản phẩm đến với nhiều người khác. Tôi tin rằng đây là một nơi không thể bỏ qua để mang sản phẩm của mình đến với nhiều người hơn. Nhưng quan trọng nhất vẫn là sự giúp sức của mọi người. Hãy theo dõi OpenNotas và đón chờ ngày ra mắt vào 02/06/2024 sắp tới đây nhé! Xin cảm ơn tất cả mọi người.  \n\n- [Coming soon: OpenNotas | Product Hunt](https://www.producthunt.com/products/opennotas)",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "Personal",
      "content": "# All about OpenNotas - What is it? \n\n## The Problem\n\nNearly 2 months ago, while being loyal to Apple Notes for writing, suddenly my iPhone broke down, forcing me to switch to an Android device due to budget constraints. At this point, I realized that Apple Notes could no longer be used on the new device. Imagine before when all notes between the computer and the phone were being synchronized smoothly, but now that process has been interrupted, causing a terribly uncomfortable situation.  \n\nWhile struggling to find a new note-taking app. Many names were explored and downloaded for trial. Some were good, some were bad. Good because they met the need for multi-platform notes, synchronization, and security. The bad part is... most of them require a fee, otherwise the number of notes or synchronization capabilities would be limited. This pushed me to a critical decision: to make a note-taking app now known as OpenNotas (ON).  \n\nThere are many lessons and new knowledge that I gained during the application development process. Most of what was discovered is summarized in a weekly diary about the process of making OpenNotas. Readers can browse the homepage for a while to see, otherwise, here is the list of articles being mentioned:  \n\n- [Creating a Note-taking App - Notas](https://2coffee.dev/en/articles/note-taking-app-notas)\n- [Diary of Making Notas - First Week](https://2coffee.dev/en/articles/diary-of-making-notas-first-week)\n- [Diary of Working on Notas - Part II](https://2coffee.dev/en/articles/diary-of-working-on-notas-part-ii)\n- [Diary of Working on Notas - Part III](https://2coffee.dev/en/articles/diary-of-working-on-notas-part-iii)\n- [Diary of Working on Notas - The Issue with Memory](https://2coffee.dev/en/articles/diary-of-working-on-notas-the-issue-with-memory)\n- [Diary of Working on Notas - Ready for Launch!](https://2coffee.dev/en/articles/diary-of-working-on-notas-ready-for-launch)\n\nDuring this time, I met again an older brother I had worked with before. After hearing the story, he suddenly said, \"What you're doing is called Indie Hackers\" - just a part of programmers who love making products. Oh! It turns out I've been doing it without knowing of its existence. After returning home, I started paying attention to this phrase, joining Indie Hackers communities to learn more, exchange, learn from people with the same hobby.  \n\nIn less than 2 weeks, ON will officially launch. So this is an article summarizing quickly the process of forming ON, what problems it was born to solve, and the lessons learned along with the difficulties, challenges.  \n\n## What is OpenNotas?\n\n![Introducing OpenNotas](tat-tan-tat-ve-opennotas-no-la-gi_introduction)\n\nOpenNotas is a simple, fast, security-focused, and completely free personal note-taking app.  \n\nOpenNotas is released as a PWA app - a type of app based on the Web platform. PWA brings more power to the app compared to regular web apps, saving a lot of time for developers who want to develop a multi-platform app. Simply because if you want to use it, you just need a device that supports a web browser connected to the Internet.  \n\nOpenNotas was originally created to solve my problem of needing a multi-platform, simple note-taking app focused on writing. But if thinking further, it can completely turn it into an Open Source product, for anyone looking for a new solution besides many apps that have been available on the market before.  \n\nDuring the process of finding a note-taking app before making ON, I have experienced many names and drawn many notable points. Compared to what is known, the strength of ON may lie in its simplicity, flexibility, and super lightweight size thanks to PWA. Just need a device that supports a browser, almost can use. However, ON is applying many modern technologies to optimize the experience, so you still need to have a modern, good enough browser to support its features.  \n\nOpenNotas can also be installed directly into the machine, you will use normally without needing an Internet connection. Data is stored permanently in the machine. OpenNotas supports a data synchronization mechanism between devices through something called an Adapter. You just need to follow the instructions to set up a synchronization server for yourself.  \n\nPersonal notes also require a strict security mechanism. Not far away like me, there is a lot of sensitive information that still needs to be written down if you don't want to forget. But having written it down, there must be a mechanism to protect it, not allowing anyone to read. ON provides a two-way data encryption mechanism based on the AES algorithm before synchronizing data to the server. That means data will be encrypted before leaving the device, you need to have an encryption key to decrypt the data. In addition, ON also has a feature to set a password for notes, data is also AES encrypted, requiring a password to access.  \n\nTemporarily forget the strengths mentioned above, ON is currently \"inferior\" compared to many famous predecessors. ON's features may not be diverse and rich but that's just a matter of time. ON's philosophy is to focus on flexibility, speed, and the best security capabilities, giving peace of mind to users.  \n\n## Lessons from the development process of OpenNotas\n\nThanks to the process of making ON, I got to know the concept of Indie Hackers. Connect with many people, participate in communities with the same hobby to start delving into this field.  \n\nON helped me delve deeper into the concept of PWA, understand more about how applications work and challenge myself in making an application product. In addition, the issue of storage on the browser is also very much concerned. Even in the heyday of modern web applications, the issue of data storage in the browser is still something very \"potato\".  \n\nON also helped me hone my writing skills. Writing the language in the app, writing a diary, writing a blog, writing documentation, writing introductions... Never have I written so much. Honestly, my mind now has nothing but lines of text running back and forth in a cramped space.  \n\nFinally, after the upcoming launch, there will certainly be many more lessons learned. But whether it's success or failure, it still brings more experience to myself. Certainly, ON is not the final product, it is just the beginning for everything later.  \n\n## What are the shortcomings?\n\nI know that running a product is not simple. This is the first Open Source application so there are many things I don't know or need time to know. If I keep it to myself and don't speak out, no one will know what problem I'm facing. Conversely, when spoken out, I will receive support from many people who had previous experience.  \n\nON was created in a hurry, built on Nuxt.js and the DaisyUI library. If you want to contribute code, you need to create a set of rules before letting the community add/edit/delete, add configuration to check whether everything is standard before \"Merge\". Honestly, I have no experience deploying this part, so what should I do next if you have solved this problem before?  \n\nAlthough I don't do much about Open Source, I still know about the automatic version numbering mechanism each time a new version is released. Or simply put, the version management mechanism and automatic update building. Which tool should I learn for simplicity?  \n\nFinally, building a community, making a place for exchange and Q&A for all ON users. In your opinion, which platform is most convenient for users?  \n\nFinally, ON is now on Product Hunt, this is a playground for those who make products, a great opportunity to promote the product to many other people. I believe this is a place that cannot be missed to bring my product to more people. But the most important thing is still the support of everyone. Please follow OpenNotas and look forward to the launch day on 02/06/2024 coming up here! Thank you all.  \n\n- [Coming soon: OpenNotas | Product Hunt](https://www.producthunt.com/products/opennotas)\n",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "OpenNotas",
      "content": "# Cộng đồng và hỗ trợ \n\nHãy tham gia kênh cộng đồng của OpenNotas để trao đổi và nhận được sự trợ giúp: https://t.me/opennotas\n\nHoặc tạo một vấn đề trên Github nếu bạn gặp sự cố ngoài ý muốn: https://github.com/tonghoai/opennotas/issues/new\n\nNgoài ra, bạn cũng có thể liên hệ trực tiếp với tôi: https://t.me/hoaitx\n\n\n",
      "createdAt": 1716737320,
      "deletedAt": null
    },
    {
      "folderName": "OpenNotas",
      "content": "# Community and Support \n\nJoin the OpenNotas community channel to exchange ideas and receive support: https://t.me/opennotas\n\nOr create an issue on Github if you encounter an unexpected problem: https://github.com/tonghoai/opennotas/issues/new\n\nAdditionally, you can also contact me directly: https://t.me/hoaitx\n\n",
      "createdAt": 1716737320,
      "deletedAt": null
    }
  ],
  "metadata": {
    "version": "0.0.1",
    "exportedAt": "2024-05-26T16:00:09.480Z"
  }
}